espressif/esp-idf/components/soc/esp32/register/soc/efuse_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#include "soc/efuse_defs.h"
#ifdef __cplusplus
extern "C" {
#endif

/** EFUSE_BLK0_RDATA0_REG register */
#define EFUSE_BLK0_RDATA0_REG (DR_REG_EFUSE_BASE + 0x0)
/** EFUSE_RD_EFUSE_WR_DIS : R; bitpos: [15:0]; default: 0;
 *  read for efuse_wr_disable
 */
#define EFUSE_RD_EFUSE_WR_DIS    0x0000FFFFU
#define EFUSE_RD_EFUSE_WR_DIS_M  (EFUSE_RD_EFUSE_WR_DIS_V << EFUSE_RD_EFUSE_WR_DIS_S)
#define EFUSE_RD_EFUSE_WR_DIS_V  0x0000FFFFU
#define EFUSE_RD_EFUSE_WR_DIS_S  0
/** EFUSE_RD_EFUSE_RD_DIS : R; bitpos: [19:16]; default: 0;
 *  read for efuse_rd_disable
 */
#define EFUSE_RD_EFUSE_RD_DIS    0x0000000FU
#define EFUSE_RD_EFUSE_RD_DIS_M  (EFUSE_RD_EFUSE_RD_DIS_V << EFUSE_RD_EFUSE_RD_DIS_S)
#define EFUSE_RD_EFUSE_RD_DIS_V  0x0000000FU
#define EFUSE_RD_EFUSE_RD_DIS_S  16
/** EFUSE_RD_FLASH_CRYPT_CNT : R; bitpos: [26:20]; default: 0;
 *  read for flash_crypt_cnt
 */
#define EFUSE_RD_FLASH_CRYPT_CNT    0x0000007FU
#define EFUSE_RD_FLASH_CRYPT_CNT_M  (EFUSE_RD_FLASH_CRYPT_CNT_V << EFUSE_RD_FLASH_CRYPT_CNT_S)
#define EFUSE_RD_FLASH_CRYPT_CNT_V  0x0000007FU
#define EFUSE_RD_FLASH_CRYPT_CNT_S  20
/** EFUSE_RD_UART_DOWNLOAD_DIS : R; bitpos: [27]; default: 0;
 *  Disable UART download mode. Valid for ESP32 V3 and newer, only
 */
#define EFUSE_RD_UART_DOWNLOAD_DIS    (BIT(27))
#define EFUSE_RD_UART_DOWNLOAD_DIS_M  (EFUSE_RD_UART_DOWNLOAD_DIS_V << EFUSE_RD_UART_DOWNLOAD_DIS_S)
#define EFUSE_RD_UART_DOWNLOAD_DIS_V  0x00000001U
#define EFUSE_RD_UART_DOWNLOAD_DIS_S  27
/** EFUSE_RESERVED_0_28 : R; bitpos: [31:28]; default: 0;
 *  reserved
 */
#define EFUSE_RESERVED_0_28    0x0000000FU
#define EFUSE_RESERVED_0_28_M  (EFUSE_RESERVED_0_28_V << EFUSE_RESERVED_0_28_S)
#define EFUSE_RESERVED_0_28_V  0x0000000FU
#define EFUSE_RESERVED_0_28_S  28

/** EFUSE_BLK0_RDATA1_REG register */
#define EFUSE_BLK0_RDATA1_REG (DR_REG_EFUSE_BASE + 0x4)
/** EFUSE_RD_MAC : R; bitpos: [31:0]; default: 0;
 *  MAC address
 */
#define EFUSE_RD_MAC    0xFFFFFFFFU
#define EFUSE_RD_MAC_M  (EFUSE_RD_MAC_V << EFUSE_RD_MAC_S)
#define EFUSE_RD_MAC_V  0xFFFFFFFFU
#define EFUSE_RD_MAC_S  0

/** EFUSE_BLK0_RDATA2_REG register */
#define EFUSE_BLK0_RDATA2_REG (DR_REG_EFUSE_BASE + 0x8)
/** EFUSE_RD_MAC_1 : R; bitpos: [15:0]; default: 0;
 *  MAC address
 */
#define EFUSE_RD_MAC_1    0x0000FFFFU
#define EFUSE_RD_MAC_1_M  (EFUSE_RD_MAC_1_V << EFUSE_RD_MAC_1_S)
#define EFUSE_RD_MAC_1_V  0x0000FFFFU
#define EFUSE_RD_MAC_1_S  0
/** EFUSE_RD_MAC_CRC : R; bitpos: [23:16]; default: 0;
 *  CRC8 for MAC address
 */
#define EFUSE_RD_MAC_CRC    0x000000FFU
#define EFUSE_RD_MAC_CRC_M  (EFUSE_RD_MAC_CRC_V << EFUSE_RD_MAC_CRC_S)
#define EFUSE_RD_MAC_CRC_V  0x000000FFU
#define EFUSE_RD_MAC_CRC_S  16
/** EFUSE_RD_RESERVE_0_88 : RW; bitpos: [31:24]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_88    0x000000FFU
#define EFUSE_RD_RESERVE_0_88_M  (EFUSE_RD_RESERVE_0_88_V << EFUSE_RD_RESERVE_0_88_S)
#define EFUSE_RD_RESERVE_0_88_V  0x000000FFU
#define EFUSE_RD_RESERVE_0_88_S  24

/** EFUSE_BLK0_RDATA3_REG register */
#define EFUSE_BLK0_RDATA3_REG (DR_REG_EFUSE_BASE + 0xc)
/** EFUSE_RD_DISABLE_APP_CPU : R; bitpos: [0]; default: 0;
 *  Disables APP CPU
 */
#define EFUSE_RD_DISABLE_APP_CPU    (BIT(0))
#define EFUSE_RD_DISABLE_APP_CPU_M  (EFUSE_RD_DISABLE_APP_CPU_V << EFUSE_RD_DISABLE_APP_CPU_S)
#define EFUSE_RD_DISABLE_APP_CPU_V  0x00000001U
#define EFUSE_RD_DISABLE_APP_CPU_S  0
/** EFUSE_RD_DISABLE_BT : R; bitpos: [1]; default: 0;
 *  Disables Bluetooth
 */
#define EFUSE_RD_DISABLE_BT    (BIT(1))
#define EFUSE_RD_DISABLE_BT_M  (EFUSE_RD_DISABLE_BT_V << EFUSE_RD_DISABLE_BT_S)
#define EFUSE_RD_DISABLE_BT_V  0x00000001U
#define EFUSE_RD_DISABLE_BT_S  1
/** EFUSE_RD_CHIP_PACKAGE_4BIT : R; bitpos: [2]; default: 0;
 *  Chip package identifier #4bit
 */
#define EFUSE_RD_CHIP_PACKAGE_4BIT    (BIT(2))
#define EFUSE_RD_CHIP_PACKAGE_4BIT_M  (EFUSE_RD_CHIP_PACKAGE_4BIT_V << EFUSE_RD_CHIP_PACKAGE_4BIT_S)
#define EFUSE_RD_CHIP_PACKAGE_4BIT_V  0x00000001U
#define EFUSE_RD_CHIP_PACKAGE_4BIT_S  2
/** EFUSE_RD_DIS_CACHE : R; bitpos: [3]; default: 0;
 *  Disables cache
 */
#define EFUSE_RD_DIS_CACHE    (BIT(3))
#define EFUSE_RD_DIS_CACHE_M  (EFUSE_RD_DIS_CACHE_V << EFUSE_RD_DIS_CACHE_S)
#define EFUSE_RD_DIS_CACHE_V  0x00000001U
#define EFUSE_RD_DIS_CACHE_S  3
/** EFUSE_RD_SPI_PAD_CONFIG_HD : R; bitpos: [8:4]; default: 0;
 *  read for SPI_pad_config_hd
 */
#define EFUSE_RD_SPI_PAD_CONFIG_HD    0x0000001FU
#define EFUSE_RD_SPI_PAD_CONFIG_HD_M  (EFUSE_RD_SPI_PAD_CONFIG_HD_V << EFUSE_RD_SPI_PAD_CONFIG_HD_S)
#define EFUSE_RD_SPI_PAD_CONFIG_HD_V  0x0000001FU
#define EFUSE_RD_SPI_PAD_CONFIG_HD_S  4
/** EFUSE_RD_CHIP_PACKAGE : RW; bitpos: [11:9]; default: 0;
 *  Chip package identifier
 */
#define EFUSE_RD_CHIP_PACKAGE    0x00000007U
#define EFUSE_RD_CHIP_PACKAGE_M  (EFUSE_RD_CHIP_PACKAGE_V << EFUSE_RD_CHIP_PACKAGE_S)
#define EFUSE_RD_CHIP_PACKAGE_V  0x00000007U
#define EFUSE_RD_CHIP_PACKAGE_S  9
/** EFUSE_RD_CHIP_CPU_FREQ_LOW : RW; bitpos: [12]; default: 0;
 *  If set alongside EFUSE_RD_CHIP_CPU_FREQ_RATED, the ESP32's max CPU frequency is
 *  rated for 160MHz. 240MHz otherwise
 */
#define EFUSE_RD_CHIP_CPU_FREQ_LOW    (BIT(12))
#define EFUSE_RD_CHIP_CPU_FREQ_LOW_M  (EFUSE_RD_CHIP_CPU_FREQ_LOW_V << EFUSE_RD_CHIP_CPU_FREQ_LOW_S)
#define EFUSE_RD_CHIP_CPU_FREQ_LOW_V  0x00000001U
#define EFUSE_RD_CHIP_CPU_FREQ_LOW_S  12
/** EFUSE_RD_CHIP_CPU_FREQ_RATED : RW; bitpos: [13]; default: 0;
 *  If set, the ESP32's maximum CPU frequency has been rated
 */
#define EFUSE_RD_CHIP_CPU_FREQ_RATED    (BIT(13))
#define EFUSE_RD_CHIP_CPU_FREQ_RATED_M  (EFUSE_RD_CHIP_CPU_FREQ_RATED_V << EFUSE_RD_CHIP_CPU_FREQ_RATED_S)
#define EFUSE_RD_CHIP_CPU_FREQ_RATED_V  0x00000001U
#define EFUSE_RD_CHIP_CPU_FREQ_RATED_S  13
/** EFUSE_RD_BLK3_PART_RESERVE : RW; bitpos: [14]; default: 0;
 *  If set, this bit indicates that BLOCK3[143:96] is reserved for internal use
 */
#define EFUSE_RD_BLK3_PART_RESERVE    (BIT(14))
#define EFUSE_RD_BLK3_PART_RESERVE_M  (EFUSE_RD_BLK3_PART_RESERVE_V << EFUSE_RD_BLK3_PART_RESERVE_S)
#define EFUSE_RD_BLK3_PART_RESERVE_V  0x00000001U
#define EFUSE_RD_BLK3_PART_RESERVE_S  14
/** EFUSE_RD_CHIP_VER_REV1 : RW; bitpos: [15]; default: 0;
 *  bit is set to 1 for rev1 silicon
 */
#define EFUSE_RD_CHIP_VER_REV1    (BIT(15))
#define EFUSE_RD_CHIP_VER_REV1_M  (EFUSE_RD_CHIP_VER_REV1_V << EFUSE_RD_CHIP_VER_REV1_S)
#define EFUSE_RD_CHIP_VER_REV1_V  0x00000001U
#define EFUSE_RD_CHIP_VER_REV1_S  15
/** EFUSE_RD_RESERVE_0_112 : RW; bitpos: [31:16]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_112    0x0000FFFFU
#define EFUSE_RD_RESERVE_0_112_M  (EFUSE_RD_RESERVE_0_112_V << EFUSE_RD_RESERVE_0_112_S)
#define EFUSE_RD_RESERVE_0_112_V  0x0000FFFFU
#define EFUSE_RD_RESERVE_0_112_S  16

/** EFUSE_BLK0_RDATA4_REG register */
#define EFUSE_BLK0_RDATA4_REG (DR_REG_EFUSE_BASE + 0x10)
/** EFUSE_RD_CLK8M_FREQ : R; bitpos: [7:0]; default: 0;
 *  8MHz clock freq override
 */
#define EFUSE_RD_CLK8M_FREQ    0x000000FFU
#define EFUSE_RD_CLK8M_FREQ_M  (EFUSE_RD_CLK8M_FREQ_V << EFUSE_RD_CLK8M_FREQ_S)
#define EFUSE_RD_CLK8M_FREQ_V  0x000000FFU
#define EFUSE_RD_CLK8M_FREQ_S  0
/** EFUSE_RD_ADC_VREF : RW; bitpos: [12:8]; default: 0;
 *  True ADC reference voltage
 */
#define EFUSE_RD_ADC_VREF    0x0000001FU
#define EFUSE_RD_ADC_VREF_M  (EFUSE_RD_ADC_VREF_V << EFUSE_RD_ADC_VREF_S)
#define EFUSE_RD_ADC_VREF_V  0x0000001FU
#define EFUSE_RD_ADC_VREF_S  8
/** EFUSE_RD_RESERVE_0_141 : RW; bitpos: [13]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_141    (BIT(13))
#define EFUSE_RD_RESERVE_0_141_M  (EFUSE_RD_RESERVE_0_141_V << EFUSE_RD_RESERVE_0_141_S)
#define EFUSE_RD_RESERVE_0_141_V  0x00000001U
#define EFUSE_RD_RESERVE_0_141_S  13
/** EFUSE_RD_XPD_SDIO_REG : R; bitpos: [14]; default: 0;
 *  read for XPD_SDIO_REG
 */
#define EFUSE_RD_XPD_SDIO_REG    (BIT(14))
#define EFUSE_RD_XPD_SDIO_REG_M  (EFUSE_RD_XPD_SDIO_REG_V << EFUSE_RD_XPD_SDIO_REG_S)
#define EFUSE_RD_XPD_SDIO_REG_V  0x00000001U
#define EFUSE_RD_XPD_SDIO_REG_S  14
/** EFUSE_RD_XPD_SDIO_TIEH : R; bitpos: [15]; default: 0;
 *  If XPD_SDIO_FORCE & XPD_SDIO_REG
 */
#define EFUSE_RD_XPD_SDIO_TIEH    (BIT(15))
#define EFUSE_RD_XPD_SDIO_TIEH_M  (EFUSE_RD_XPD_SDIO_TIEH_V << EFUSE_RD_XPD_SDIO_TIEH_S)
#define EFUSE_RD_XPD_SDIO_TIEH_V  0x00000001U
#define EFUSE_RD_XPD_SDIO_TIEH_S  15
/** EFUSE_RD_XPD_SDIO_FORCE : R; bitpos: [16]; default: 0;
 *  Ignore MTDI pin (GPIO12) for VDD_SDIO on reset
 */
#define EFUSE_RD_XPD_SDIO_FORCE    (BIT(16))
#define EFUSE_RD_XPD_SDIO_FORCE_M  (EFUSE_RD_XPD_SDIO_FORCE_V << EFUSE_RD_XPD_SDIO_FORCE_S)
#define EFUSE_RD_XPD_SDIO_FORCE_V  0x00000001U
#define EFUSE_RD_XPD_SDIO_FORCE_S  16
/** EFUSE_RD_RESERVE_0_145 : RW; bitpos: [31:17]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_145    0x00007FFFU
#define EFUSE_RD_RESERVE_0_145_M  (EFUSE_RD_RESERVE_0_145_V << EFUSE_RD_RESERVE_0_145_S)
#define EFUSE_RD_RESERVE_0_145_V  0x00007FFFU
#define EFUSE_RD_RESERVE_0_145_S  17

/** EFUSE_BLK0_RDATA5_REG register */
#define EFUSE_BLK0_RDATA5_REG (DR_REG_EFUSE_BASE + 0x14)
/** EFUSE_RD_SPI_PAD_CONFIG_CLK : R; bitpos: [4:0]; default: 0;
 *  read for SPI_pad_config_clk
 */
#define EFUSE_RD_SPI_PAD_CONFIG_CLK    0x0000001FU
#define EFUSE_RD_SPI_PAD_CONFIG_CLK_M  (EFUSE_RD_SPI_PAD_CONFIG_CLK_V << EFUSE_RD_SPI_PAD_CONFIG_CLK_S)
#define EFUSE_RD_SPI_PAD_CONFIG_CLK_V  0x0000001FU
#define EFUSE_RD_SPI_PAD_CONFIG_CLK_S  0
/** EFUSE_RD_SPI_PAD_CONFIG_Q : R; bitpos: [9:5]; default: 0;
 *  read for SPI_pad_config_q
 */
#define EFUSE_RD_SPI_PAD_CONFIG_Q    0x0000001FU
#define EFUSE_RD_SPI_PAD_CONFIG_Q_M  (EFUSE_RD_SPI_PAD_CONFIG_Q_V << EFUSE_RD_SPI_PAD_CONFIG_Q_S)
#define EFUSE_RD_SPI_PAD_CONFIG_Q_V  0x0000001FU
#define EFUSE_RD_SPI_PAD_CONFIG_Q_S  5
/** EFUSE_RD_SPI_PAD_CONFIG_D : R; bitpos: [14:10]; default: 0;
 *  read for SPI_pad_config_d
 */
#define EFUSE_RD_SPI_PAD_CONFIG_D    0x0000001FU
#define EFUSE_RD_SPI_PAD_CONFIG_D_M  (EFUSE_RD_SPI_PAD_CONFIG_D_V << EFUSE_RD_SPI_PAD_CONFIG_D_S)
#define EFUSE_RD_SPI_PAD_CONFIG_D_V  0x0000001FU
#define EFUSE_RD_SPI_PAD_CONFIG_D_S  10
/** EFUSE_RD_SPI_PAD_CONFIG_CS0 : R; bitpos: [19:15]; default: 0;
 *  read for SPI_pad_config_cs0
 */
#define EFUSE_RD_SPI_PAD_CONFIG_CS0    0x0000001FU
#define EFUSE_RD_SPI_PAD_CONFIG_CS0_M  (EFUSE_RD_SPI_PAD_CONFIG_CS0_V << EFUSE_RD_SPI_PAD_CONFIG_CS0_S)
#define EFUSE_RD_SPI_PAD_CONFIG_CS0_V  0x0000001FU
#define EFUSE_RD_SPI_PAD_CONFIG_CS0_S  15
/** EFUSE_RD_CHIP_VER_REV2 : R; bitpos: [20]; default: 0; */
#define EFUSE_RD_CHIP_VER_REV2    (BIT(20))
#define EFUSE_RD_CHIP_VER_REV2_M  (EFUSE_RD_CHIP_VER_REV2_V << EFUSE_RD_CHIP_VER_REV2_S)
#define EFUSE_RD_CHIP_VER_REV2_V  0x00000001U
#define EFUSE_RD_CHIP_VER_REV2_S  20
/** EFUSE_RD_RESERVE_0_181 : RW; bitpos: [21]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_181    (BIT(21))
#define EFUSE_RD_RESERVE_0_181_M  (EFUSE_RD_RESERVE_0_181_V << EFUSE_RD_RESERVE_0_181_S)
#define EFUSE_RD_RESERVE_0_181_V  0x00000001U
#define EFUSE_RD_RESERVE_0_181_S  21
/** EFUSE_RD_VOL_LEVEL_HP_INV : R; bitpos: [23:22]; default: 0;
 *  This field stores the voltage level for CPU to run at 240 MHz, or for flash/PSRAM
 *  to run at 80 MHz.0x0: level 7; 0x1: level 6; 0x2: level 5; 0x3: level 4. (RO)
 */
#define EFUSE_RD_VOL_LEVEL_HP_INV    0x00000003U
#define EFUSE_RD_VOL_LEVEL_HP_INV_M  (EFUSE_RD_VOL_LEVEL_HP_INV_V << EFUSE_RD_VOL_LEVEL_HP_INV_S)
#define EFUSE_RD_VOL_LEVEL_HP_INV_V  0x00000003U
#define EFUSE_RD_VOL_LEVEL_HP_INV_S  22
/** EFUSE_RD_WAFER_VERSION_MINOR : R; bitpos: [25:24]; default: 0; */
#define EFUSE_RD_WAFER_VERSION_MINOR    0x00000003U
#define EFUSE_RD_WAFER_VERSION_MINOR_M  (EFUSE_RD_WAFER_VERSION_MINOR_V << EFUSE_RD_WAFER_VERSION_MINOR_S)
#define EFUSE_RD_WAFER_VERSION_MINOR_V  0x00000003U
#define EFUSE_RD_WAFER_VERSION_MINOR_S  24
/** EFUSE_RD_RESERVE_0_186 : RW; bitpos: [27:26]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_186    0x00000003U
#define EFUSE_RD_RESERVE_0_186_M  (EFUSE_RD_RESERVE_0_186_V << EFUSE_RD_RESERVE_0_186_S)
#define EFUSE_RD_RESERVE_0_186_V  0x00000003U
#define EFUSE_RD_RESERVE_0_186_S  26
/** EFUSE_RD_FLASH_CRYPT_CONFIG : R; bitpos: [31:28]; default: 0;
 *  read for flash_crypt_config
 */
#define EFUSE_RD_FLASH_CRYPT_CONFIG    0x0000000FU
#define EFUSE_RD_FLASH_CRYPT_CONFIG_M  (EFUSE_RD_FLASH_CRYPT_CONFIG_V << EFUSE_RD_FLASH_CRYPT_CONFIG_S)
#define EFUSE_RD_FLASH_CRYPT_CONFIG_V  0x0000000FU
#define EFUSE_RD_FLASH_CRYPT_CONFIG_S  28

/** EFUSE_BLK0_RDATA6_REG register */
#define EFUSE_BLK0_RDATA6_REG (DR_REG_EFUSE_BASE + 0x18)
/** EFUSE_RD_CODING_SCHEME : R; bitpos: [1:0]; default: 0;
 *  read for coding_scheme
 */
#define EFUSE_RD_CODING_SCHEME    0x00000003U
#define EFUSE_RD_CODING_SCHEME_M  (EFUSE_RD_CODING_SCHEME_V << EFUSE_RD_CODING_SCHEME_S)
#define EFUSE_RD_CODING_SCHEME_V  0x00000003U
#define EFUSE_RD_CODING_SCHEME_S  0
/** EFUSE_RD_CONSOLE_DEBUG_DISABLE : R; bitpos: [2]; default: 0;
 *  read for console_debug_disable
 */
#define EFUSE_RD_CONSOLE_DEBUG_DISABLE    (BIT(2))
#define EFUSE_RD_CONSOLE_DEBUG_DISABLE_M  (EFUSE_RD_CONSOLE_DEBUG_DISABLE_V << EFUSE_RD_CONSOLE_DEBUG_DISABLE_S)
#define EFUSE_RD_CONSOLE_DEBUG_DISABLE_V  0x00000001U
#define EFUSE_RD_CONSOLE_DEBUG_DISABLE_S  2
/** EFUSE_RD_DISABLE_SDIO_HOST : R; bitpos: [3]; default: 0; */
#define EFUSE_RD_DISABLE_SDIO_HOST    (BIT(3))
#define EFUSE_RD_DISABLE_SDIO_HOST_M  (EFUSE_RD_DISABLE_SDIO_HOST_V << EFUSE_RD_DISABLE_SDIO_HOST_S)
#define EFUSE_RD_DISABLE_SDIO_HOST_V  0x00000001U
#define EFUSE_RD_DISABLE_SDIO_HOST_S  3
/** EFUSE_RD_ABS_DONE_0 : R; bitpos: [4]; default: 0;
 *  read for abstract_done_0
 */
#define EFUSE_RD_ABS_DONE_0    (BIT(4))
#define EFUSE_RD_ABS_DONE_0_M  (EFUSE_RD_ABS_DONE_0_V << EFUSE_RD_ABS_DONE_0_S)
#define EFUSE_RD_ABS_DONE_0_V  0x00000001U
#define EFUSE_RD_ABS_DONE_0_S  4
/** EFUSE_RD_ABS_DONE_1 : R; bitpos: [5]; default: 0;
 *  read for abstract_done_1
 */
#define EFUSE_RD_ABS_DONE_1    (BIT(5))
#define EFUSE_RD_ABS_DONE_1_M  (EFUSE_RD_ABS_DONE_1_V << EFUSE_RD_ABS_DONE_1_S)
#define EFUSE_RD_ABS_DONE_1_V  0x00000001U
#define EFUSE_RD_ABS_DONE_1_S  5
/** EFUSE_RD_JTAG_DISABLE : R; bitpos: [6]; default: 0;
 *  Disable JTAG
 */
#define EFUSE_RD_JTAG_DISABLE    (BIT(6))
#define EFUSE_RD_JTAG_DISABLE_M  (EFUSE_RD_JTAG_DISABLE_V << EFUSE_RD_JTAG_DISABLE_S)
#define EFUSE_RD_JTAG_DISABLE_V  0x00000001U
#define EFUSE_RD_JTAG_DISABLE_S  6
/** EFUSE_RD_DISABLE_DL_ENCRYPT : R; bitpos: [7]; default: 0;
 *  read for download_dis_encrypt
 */
#define EFUSE_RD_DISABLE_DL_ENCRYPT    (BIT(7))
#define EFUSE_RD_DISABLE_DL_ENCRYPT_M  (EFUSE_RD_DISABLE_DL_ENCRYPT_V << EFUSE_RD_DISABLE_DL_ENCRYPT_S)
#define EFUSE_RD_DISABLE_DL_ENCRYPT_V  0x00000001U
#define EFUSE_RD_DISABLE_DL_ENCRYPT_S  7
/** EFUSE_RD_DISABLE_DL_DECRYPT : R; bitpos: [8]; default: 0;
 *  read for download_dis_decrypt
 */
#define EFUSE_RD_DISABLE_DL_DECRYPT    (BIT(8))
#define EFUSE_RD_DISABLE_DL_DECRYPT_M  (EFUSE_RD_DISABLE_DL_DECRYPT_V << EFUSE_RD_DISABLE_DL_DECRYPT_S)
#define EFUSE_RD_DISABLE_DL_DECRYPT_V  0x00000001U
#define EFUSE_RD_DISABLE_DL_DECRYPT_S  8
/** EFUSE_RD_DISABLE_DL_CACHE : R; bitpos: [9]; default: 0;
 *  read for download_dis_cache
 */
#define EFUSE_RD_DISABLE_DL_CACHE    (BIT(9))
#define EFUSE_RD_DISABLE_DL_CACHE_M  (EFUSE_RD_DISABLE_DL_CACHE_V << EFUSE_RD_DISABLE_DL_CACHE_S)
#define EFUSE_RD_DISABLE_DL_CACHE_V  0x00000001U
#define EFUSE_RD_DISABLE_DL_CACHE_S  9
/** EFUSE_RD_KEY_STATUS : R; bitpos: [10]; default: 0;
 *  read for key_status
 */
#define EFUSE_RD_KEY_STATUS    (BIT(10))
#define EFUSE_RD_KEY_STATUS_M  (EFUSE_RD_KEY_STATUS_V << EFUSE_RD_KEY_STATUS_S)
#define EFUSE_RD_KEY_STATUS_V  0x00000001U
#define EFUSE_RD_KEY_STATUS_S  10
/** EFUSE_RD_RESERVE_0_203 : RW; bitpos: [31:11]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RD_RESERVE_0_203    0x001FFFFFU
#define EFUSE_RD_RESERVE_0_203_M  (EFUSE_RD_RESERVE_0_203_V << EFUSE_RD_RESERVE_0_203_S)
#define EFUSE_RD_RESERVE_0_203_V  0x001FFFFFU
#define EFUSE_RD_RESERVE_0_203_S  11

/** EFUSE_BLK0_WDATA0_REG register */
#define EFUSE_BLK0_WDATA0_REG (DR_REG_EFUSE_BASE + 0x1c)
/** EFUSE_WR_DIS : RW; bitpos: [15:0]; default: 0;
 *  program for efuse_wr_disable
 */
#define EFUSE_WR_DIS    0x0000FFFFU
#define EFUSE_WR_DIS_M  (EFUSE_WR_DIS_V << EFUSE_WR_DIS_S)
#define EFUSE_WR_DIS_V  0x0000FFFFU
#define EFUSE_WR_DIS_S  0
/** EFUSE_RD_DIS : RW; bitpos: [19:16]; default: 0;
 *  program for efuse_rd_disable
 */
#define EFUSE_RD_DIS    0x0000000FU
#define EFUSE_RD_DIS_M  (EFUSE_RD_DIS_V << EFUSE_RD_DIS_S)
#define EFUSE_RD_DIS_V  0x0000000FU
#define EFUSE_RD_DIS_S  16
/** EFUSE_FLASH_CRYPT_CNT : RW; bitpos: [26:20]; default: 0;
 *  program for flash_crypt_cnt
 */
#define EFUSE_FLASH_CRYPT_CNT    0x0000007FU
#define EFUSE_FLASH_CRYPT_CNT_M  (EFUSE_FLASH_CRYPT_CNT_V << EFUSE_FLASH_CRYPT_CNT_S)
#define EFUSE_FLASH_CRYPT_CNT_V  0x0000007FU
#define EFUSE_FLASH_CRYPT_CNT_S  20

/** EFUSE_BLK0_WDATA1_REG register */
#define EFUSE_BLK0_WDATA1_REG (DR_REG_EFUSE_BASE + 0x20)
/** EFUSE_WIFI_MAC_CRC_LOW : RW; bitpos: [31:0]; default: 0;
 *  program for low 32bit WIFI_MAC_Address
 */
#define EFUSE_WIFI_MAC_CRC_LOW    0xFFFFFFFFU
#define EFUSE_WIFI_MAC_CRC_LOW_M  (EFUSE_WIFI_MAC_CRC_LOW_V << EFUSE_WIFI_MAC_CRC_LOW_S)
#define EFUSE_WIFI_MAC_CRC_LOW_V  0xFFFFFFFFU
#define EFUSE_WIFI_MAC_CRC_LOW_S  0

/** EFUSE_BLK0_WDATA2_REG register */
#define EFUSE_BLK0_WDATA2_REG (DR_REG_EFUSE_BASE + 0x24)
/** EFUSE_WIFI_MAC_CRC_HIGH : RW; bitpos: [23:0]; default: 0;
 *  program for high 24bit WIFI_MAC_Address
 */
#define EFUSE_WIFI_MAC_CRC_HIGH    0x00FFFFFFU
#define EFUSE_WIFI_MAC_CRC_HIGH_M  (EFUSE_WIFI_MAC_CRC_HIGH_V << EFUSE_WIFI_MAC_CRC_HIGH_S)
#define EFUSE_WIFI_MAC_CRC_HIGH_V  0x00FFFFFFU
#define EFUSE_WIFI_MAC_CRC_HIGH_S  0

/** EFUSE_BLK0_WDATA3_REG register */
#define EFUSE_BLK0_WDATA3_REG (DR_REG_EFUSE_BASE + 0x28)
/** EFUSE_DISABLE_APP_CPU : R; bitpos: [0]; default: 0;
 *  Disables APP CPU
 */
#define EFUSE_DISABLE_APP_CPU    (BIT(0))
#define EFUSE_DISABLE_APP_CPU_M  (EFUSE_DISABLE_APP_CPU_V << EFUSE_DISABLE_APP_CPU_S)
#define EFUSE_DISABLE_APP_CPU_V  0x00000001U
#define EFUSE_DISABLE_APP_CPU_S  0
/** EFUSE_DISABLE_BT : R; bitpos: [1]; default: 0;
 *  Disables Bluetooth
 */
#define EFUSE_DISABLE_BT    (BIT(1))
#define EFUSE_DISABLE_BT_M  (EFUSE_DISABLE_BT_V << EFUSE_DISABLE_BT_S)
#define EFUSE_DISABLE_BT_V  0x00000001U
#define EFUSE_DISABLE_BT_S  1
/** EFUSE_CHIP_PACKAGE_4BIT : R; bitpos: [2]; default: 0;
 *  Chip package identifier #4bit
 */
#define EFUSE_CHIP_PACKAGE_4BIT    (BIT(2))
#define EFUSE_CHIP_PACKAGE_4BIT_M  (EFUSE_CHIP_PACKAGE_4BIT_V << EFUSE_CHIP_PACKAGE_4BIT_S)
#define EFUSE_CHIP_PACKAGE_4BIT_V  0x00000001U
#define EFUSE_CHIP_PACKAGE_4BIT_S  2
/** EFUSE_DIS_CACHE : R; bitpos: [3]; default: 0;
 *  Disables cache
 */
#define EFUSE_DIS_CACHE    (BIT(3))
#define EFUSE_DIS_CACHE_M  (EFUSE_DIS_CACHE_V << EFUSE_DIS_CACHE_S)
#define EFUSE_DIS_CACHE_V  0x00000001U
#define EFUSE_DIS_CACHE_S  3
/** EFUSE_SPI_PAD_CONFIG_HD : R; bitpos: [8:4]; default: 0;
 *  program for SPI_pad_config_hd
 */
#define EFUSE_SPI_PAD_CONFIG_HD    0x0000001FU
#define EFUSE_SPI_PAD_CONFIG_HD_M  (EFUSE_SPI_PAD_CONFIG_HD_V << EFUSE_SPI_PAD_CONFIG_HD_S)
#define EFUSE_SPI_PAD_CONFIG_HD_V  0x0000001FU
#define EFUSE_SPI_PAD_CONFIG_HD_S  4
/** EFUSE_CHIP_PACKAGE : RW; bitpos: [11:9]; default: 0;
 *  Chip package identifier
 */
#define EFUSE_CHIP_PACKAGE    0x00000007U
#define EFUSE_CHIP_PACKAGE_M  (EFUSE_CHIP_PACKAGE_V << EFUSE_CHIP_PACKAGE_S)
#define EFUSE_CHIP_PACKAGE_V  0x00000007U
#define EFUSE_CHIP_PACKAGE_S  9
/** EFUSE_CHIP_CPU_FREQ_LOW : RW; bitpos: [12]; default: 0;
 *  If set alongside EFUSE_RD_CHIP_CPU_FREQ_RATED, the ESP32's max CPU frequency is
 *  rated for 160MHz. 240MHz otherwise
 */
#define EFUSE_CHIP_CPU_FREQ_LOW    (BIT(12))
#define EFUSE_CHIP_CPU_FREQ_LOW_M  (EFUSE_CHIP_CPU_FREQ_LOW_V << EFUSE_CHIP_CPU_FREQ_LOW_S)
#define EFUSE_CHIP_CPU_FREQ_LOW_V  0x00000001U
#define EFUSE_CHIP_CPU_FREQ_LOW_S  12
/** EFUSE_CHIP_CPU_FREQ_RATED : RW; bitpos: [13]; default: 0;
 *  If set, the ESP32's maximum CPU frequency has been rated
 */
#define EFUSE_CHIP_CPU_FREQ_RATED    (BIT(13))
#define EFUSE_CHIP_CPU_FREQ_RATED_M  (EFUSE_CHIP_CPU_FREQ_RATED_V << EFUSE_CHIP_CPU_FREQ_RATED_S)
#define EFUSE_CHIP_CPU_FREQ_RATED_V  0x00000001U
#define EFUSE_CHIP_CPU_FREQ_RATED_S  13
/** EFUSE_BLK3_PART_RESERVE : RW; bitpos: [14]; default: 0;
 *  If set, this bit indicates that BLOCK3[143:96] is reserved for internal use
 */
#define EFUSE_BLK3_PART_RESERVE    (BIT(14))
#define EFUSE_BLK3_PART_RESERVE_M  (EFUSE_BLK3_PART_RESERVE_V << EFUSE_BLK3_PART_RESERVE_S)
#define EFUSE_BLK3_PART_RESERVE_V  0x00000001U
#define EFUSE_BLK3_PART_RESERVE_S  14
/** EFUSE_CHIP_VER_REV1 : RW; bitpos: [15]; default: 0;
 *  bit is set to 1 for rev1 silicon
 */
#define EFUSE_CHIP_VER_REV1    (BIT(15))
#define EFUSE_CHIP_VER_REV1_M  (EFUSE_CHIP_VER_REV1_V << EFUSE_CHIP_VER_REV1_S)
#define EFUSE_CHIP_VER_REV1_V  0x00000001U
#define EFUSE_CHIP_VER_REV1_S  15
/** EFUSE_RESERVE_0_112 : RW; bitpos: [31:16]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RESERVE_0_112    0x0000FFFFU
#define EFUSE_RESERVE_0_112_M  (EFUSE_RESERVE_0_112_V << EFUSE_RESERVE_0_112_S)
#define EFUSE_RESERVE_0_112_V  0x0000FFFFU
#define EFUSE_RESERVE_0_112_S  16

/** EFUSE_BLK0_WDATA4_REG register */
#define EFUSE_BLK0_WDATA4_REG (DR_REG_EFUSE_BASE + 0x2c)
/** EFUSE_CLK8M_FREQ : R; bitpos: [7:0]; default: 0;
 *  8MHz clock freq override
 */
#define EFUSE_CLK8M_FREQ    0x000000FFU
#define EFUSE_CLK8M_FREQ_M  (EFUSE_CLK8M_FREQ_V << EFUSE_CLK8M_FREQ_S)
#define EFUSE_CLK8M_FREQ_V  0x000000FFU
#define EFUSE_CLK8M_FREQ_S  0
/** EFUSE_ADC_VREF : RW; bitpos: [12:8]; default: 0;
 *  True ADC reference voltage
 */
#define EFUSE_ADC_VREF    0x0000001FU
#define EFUSE_ADC_VREF_M  (EFUSE_ADC_VREF_V << EFUSE_ADC_VREF_S)
#define EFUSE_ADC_VREF_V  0x0000001FU
#define EFUSE_ADC_VREF_S  8
/** EFUSE_RESERVE_0_141 : RW; bitpos: [13]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RESERVE_0_141    (BIT(13))
#define EFUSE_RESERVE_0_141_M  (EFUSE_RESERVE_0_141_V << EFUSE_RESERVE_0_141_S)
#define EFUSE_RESERVE_0_141_V  0x00000001U
#define EFUSE_RESERVE_0_141_S  13
/** EFUSE_XPD_SDIO_REG : R; bitpos: [14]; default: 0;
 *  program for XPD_SDIO_REG
 */
#define EFUSE_XPD_SDIO_REG    (BIT(14))
#define EFUSE_XPD_SDIO_REG_M  (EFUSE_XPD_SDIO_REG_V << EFUSE_XPD_SDIO_REG_S)
#define EFUSE_XPD_SDIO_REG_V  0x00000001U
#define EFUSE_XPD_SDIO_REG_S  14
/** EFUSE_XPD_SDIO_TIEH : R; bitpos: [15]; default: 0;
 *  If XPD_SDIO_FORCE & XPD_SDIO_REG
 */
#define EFUSE_XPD_SDIO_TIEH    (BIT(15))
#define EFUSE_XPD_SDIO_TIEH_M  (EFUSE_XPD_SDIO_TIEH_V << EFUSE_XPD_SDIO_TIEH_S)
#define EFUSE_XPD_SDIO_TIEH_V  0x00000001U
#define EFUSE_XPD_SDIO_TIEH_S  15
/** EFUSE_XPD_SDIO_FORCE : R; bitpos: [16]; default: 0;
 *  Ignore MTDI pin (GPIO12) for VDD_SDIO on reset
 */
#define EFUSE_XPD_SDIO_FORCE    (BIT(16))
#define EFUSE_XPD_SDIO_FORCE_M  (EFUSE_XPD_SDIO_FORCE_V << EFUSE_XPD_SDIO_FORCE_S)
#define EFUSE_XPD_SDIO_FORCE_V  0x00000001U
#define EFUSE_XPD_SDIO_FORCE_S  16
/** EFUSE_RESERVE_0_145 : RW; bitpos: [31:17]; default: 0;
 *  Reserved, it was created by set_missed_fields_in_regs func
 */
#define EFUSE_RESERVE_0_145    0x00007FFFU
#define EFUSE_RESERVE_0_145_M  (EFUSE_RESERVE_0_145_V << EFUSE_RESERVE_0_145_S)
#define EFUSE_RESERVE_0_145_V  0x00007FFFU
#define EFUSE_RESERVE_0_145_S  17

