espressif/esp-idf/components/soc/esp32/register/soc/efuse_reg.h
/** EFUSE_BLK3_WDATA2_REG register */
#define EFUSE_BLK3_WDATA2_REG (DR_REG_EFUSE_BASE + 0xe0)
/** EFUSE_BLK3_DIN2 : RW; bitpos: [31:0]; default: 0;
 *  program for BLOCK3
 */
#define EFUSE_BLK3_DIN2    0xFFFFFFFFU
#define EFUSE_BLK3_DIN2_M  (EFUSE_BLK3_DIN2_V << EFUSE_BLK3_DIN2_S)
#define EFUSE_BLK3_DIN2_V  0xFFFFFFFFU
#define EFUSE_BLK3_DIN2_S  0

/** EFUSE_BLK3_WDATA3_REG register */
#define EFUSE_BLK3_WDATA3_REG (DR_REG_EFUSE_BASE + 0xe4)
/** EFUSE_ADC1_TP_LOW : RW; bitpos: [6:0]; default: 0;
 *  ADC1 Two Point calibration low point. Only valid if EFUSE_RD_BLK3_PART_RESERVE
 */
#define EFUSE_ADC1_TP_LOW    0x0000007FU
#define EFUSE_ADC1_TP_LOW_M  (EFUSE_ADC1_TP_LOW_V << EFUSE_ADC1_TP_LOW_S)
#define EFUSE_ADC1_TP_LOW_V  0x0000007FU
#define EFUSE_ADC1_TP_LOW_S  0
/** EFUSE_ADC1_TP_HIGH : RW; bitpos: [15:7]; default: 0;
 *  ADC1 Two Point calibration high point. Only valid if EFUSE_RD_BLK3_PART_RESERVE
 */
#define EFUSE_ADC1_TP_HIGH    0x000001FFU
#define EFUSE_ADC1_TP_HIGH_M  (EFUSE_ADC1_TP_HIGH_V << EFUSE_ADC1_TP_HIGH_S)
#define EFUSE_ADC1_TP_HIGH_V  0x000001FFU
#define EFUSE_ADC1_TP_HIGH_S  7
/** EFUSE_ADC2_TP_LOW : RW; bitpos: [22:16]; default: 0;
 *  ADC2 Two Point calibration low point. Only valid if EFUSE_RD_BLK3_PART_RESERVE
 */
#define EFUSE_ADC2_TP_LOW    0x0000007FU
#define EFUSE_ADC2_TP_LOW_M  (EFUSE_ADC2_TP_LOW_V << EFUSE_ADC2_TP_LOW_S)
#define EFUSE_ADC2_TP_LOW_V  0x0000007FU
#define EFUSE_ADC2_TP_LOW_S  16
/** EFUSE_ADC2_TP_HIGH : RW; bitpos: [31:23]; default: 0;
 *  ADC2 Two Point calibration high point. Only valid if EFUSE_RD_BLK3_PART_RESERVE
 */
#define EFUSE_ADC2_TP_HIGH    0x000001FFU
#define EFUSE_ADC2_TP_HIGH_M  (EFUSE_ADC2_TP_HIGH_V << EFUSE_ADC2_TP_HIGH_S)
#define EFUSE_ADC2_TP_HIGH_V  0x000001FFU
#define EFUSE_ADC2_TP_HIGH_S  23

/** EFUSE_BLK3_WDATA4_REG register */
#define EFUSE_BLK3_WDATA4_REG (DR_REG_EFUSE_BASE + 0xe8)
/** EFUSE_SECURE_VERSION : R; bitpos: [31:0]; default: 0;
 *  Secure version for anti-rollback
 */
#define EFUSE_SECURE_VERSION    0xFFFFFFFFU
#define EFUSE_SECURE_VERSION_M  (EFUSE_SECURE_VERSION_V << EFUSE_SECURE_VERSION_S)
#define EFUSE_SECURE_VERSION_V  0xFFFFFFFFU
#define EFUSE_SECURE_VERSION_S  0

/** EFUSE_BLK3_WDATA5_REG register */
#define EFUSE_BLK3_WDATA5_REG (DR_REG_EFUSE_BASE + 0xec)
/** EFUSE_BLK3_DIN5 : RW; bitpos: [31:0]; default: 0;
 *  program for BLOCK3
 */
#define EFUSE_BLK3_DIN5    0xFFFFFFFFU
#define EFUSE_BLK3_DIN5_M  (EFUSE_BLK3_DIN5_V << EFUSE_BLK3_DIN5_S)
#define EFUSE_BLK3_DIN5_V  0xFFFFFFFFU
#define EFUSE_BLK3_DIN5_S  0

/** EFUSE_BLK3_WDATA6_REG register */
#define EFUSE_BLK3_WDATA6_REG (DR_REG_EFUSE_BASE + 0xf0)
/** EFUSE_BLK3_DIN6 : RW; bitpos: [31:0]; default: 0;
 *  program for BLOCK3
 */
#define EFUSE_BLK3_DIN6    0xFFFFFFFFU
#define EFUSE_BLK3_DIN6_M  (EFUSE_BLK3_DIN6_V << EFUSE_BLK3_DIN6_S)
#define EFUSE_BLK3_DIN6_V  0xFFFFFFFFU
#define EFUSE_BLK3_DIN6_S  0

/** EFUSE_BLK3_WDATA7_REG register */
#define EFUSE_BLK3_WDATA7_REG (DR_REG_EFUSE_BASE + 0xf4)
/** EFUSE_BLK3_DIN7 : RW; bitpos: [31:0]; default: 0;
 *  program for BLOCK3
 */
#define EFUSE_BLK3_DIN7    0xFFFFFFFFU
#define EFUSE_BLK3_DIN7_M  (EFUSE_BLK3_DIN7_V << EFUSE_BLK3_DIN7_S)
#define EFUSE_BLK3_DIN7_V  0xFFFFFFFFU
#define EFUSE_BLK3_DIN7_S  0

/** EFUSE_CLK_REG register */
#define EFUSE_CLK_REG (DR_REG_EFUSE_BASE + 0xf8)
/** EFUSE_CLK_SEL0 : RW; bitpos: [7:0]; default: 82;
 *  efuse timing configure
 */
#define EFUSE_CLK_SEL0    0x000000FFU
#define EFUSE_CLK_SEL0_M  (EFUSE_CLK_SEL0_V << EFUSE_CLK_SEL0_S)
#define EFUSE_CLK_SEL0_V  0x000000FFU
#define EFUSE_CLK_SEL0_S  0
/** EFUSE_CLK_SEL1 : RW; bitpos: [15:8]; default: 64;
 *  efuse timing configure
 */
#define EFUSE_CLK_SEL1    0x000000FFU
#define EFUSE_CLK_SEL1_M  (EFUSE_CLK_SEL1_V << EFUSE_CLK_SEL1_S)
#define EFUSE_CLK_SEL1_V  0x000000FFU
#define EFUSE_CLK_SEL1_S  8
/** EFUSE_CLK_EN : RW; bitpos: [16]; default: 0; */
#define EFUSE_CLK_EN    (BIT(16))
#define EFUSE_CLK_EN_M  (EFUSE_CLK_EN_V << EFUSE_CLK_EN_S)
#define EFUSE_CLK_EN_V  0x00000001U
#define EFUSE_CLK_EN_S  16

/** EFUSE_CONF_REG register */
#define EFUSE_CONF_REG (DR_REG_EFUSE_BASE + 0xfc)
/** EFUSE_OP_CODE : RW; bitpos: [15:0]; default: 0;
 *  efuse operation code
 */
#define EFUSE_OP_CODE    0x0000FFFFU
#define EFUSE_OP_CODE_M  (EFUSE_OP_CODE_V << EFUSE_OP_CODE_S)
#define EFUSE_OP_CODE_V  0x0000FFFFU
#define EFUSE_OP_CODE_S  0
/** EFUSE_FORCE_NO_WR_RD_DIS : RW; bitpos: [16]; default: 1; */
#define EFUSE_FORCE_NO_WR_RD_DIS    (BIT(16))
#define EFUSE_FORCE_NO_WR_RD_DIS_M  (EFUSE_FORCE_NO_WR_RD_DIS_V << EFUSE_FORCE_NO_WR_RD_DIS_S)
#define EFUSE_FORCE_NO_WR_RD_DIS_V  0x00000001U
#define EFUSE_FORCE_NO_WR_RD_DIS_S  16

/** EFUSE_STATUS_REG register */
#define EFUSE_STATUS_REG (DR_REG_EFUSE_BASE + 0x100)
/** EFUSE_DEBUG : R; bitpos: [31:0]; default: 0; */
#define EFUSE_DEBUG    0xFFFFFFFFU
#define EFUSE_DEBUG_M  (EFUSE_DEBUG_V << EFUSE_DEBUG_S)
#define EFUSE_DEBUG_V  0xFFFFFFFFU
#define EFUSE_DEBUG_S  0

/** EFUSE_CMD_REG register */
#define EFUSE_CMD_REG (DR_REG_EFUSE_BASE + 0x104)
/** EFUSE_READ_CMD : RW; bitpos: [0]; default: 0;
 *  command for read
 */
#define EFUSE_READ_CMD    (BIT(0))
#define EFUSE_READ_CMD_M  (EFUSE_READ_CMD_V << EFUSE_READ_CMD_S)
#define EFUSE_READ_CMD_V  0x00000001U
#define EFUSE_READ_CMD_S  0
/** EFUSE_PGM_CMD : RW; bitpos: [1]; default: 0;
 *  command for program
 */
#define EFUSE_PGM_CMD    (BIT(1))
#define EFUSE_PGM_CMD_M  (EFUSE_PGM_CMD_V << EFUSE_PGM_CMD_S)
#define EFUSE_PGM_CMD_V  0x00000001U
#define EFUSE_PGM_CMD_S  1

/** EFUSE_INT_RAW_REG register */
#define EFUSE_INT_RAW_REG (DR_REG_EFUSE_BASE + 0x108)
/** EFUSE_READ_DONE_INT_RAW : R; bitpos: [0]; default: 0;
 *  read done interrupt raw status
 */
#define EFUSE_READ_DONE_INT_RAW    (BIT(0))
#define EFUSE_READ_DONE_INT_RAW_M  (EFUSE_READ_DONE_INT_RAW_V << EFUSE_READ_DONE_INT_RAW_S)
#define EFUSE_READ_DONE_INT_RAW_V  0x00000001U
#define EFUSE_READ_DONE_INT_RAW_S  0
/** EFUSE_PGM_DONE_INT_RAW : R; bitpos: [1]; default: 0;
 *  program done interrupt raw status
 */
#define EFUSE_PGM_DONE_INT_RAW    (BIT(1))
#define EFUSE_PGM_DONE_INT_RAW_M  (EFUSE_PGM_DONE_INT_RAW_V << EFUSE_PGM_DONE_INT_RAW_S)
#define EFUSE_PGM_DONE_INT_RAW_V  0x00000001U
#define EFUSE_PGM_DONE_INT_RAW_S  1

